{
  "_class_name": "WanPipeline",
  "_diffusers_version": "0.35.0.dev0",
  "boundary_ratio": null,
  "expand_timesteps": true,
  "scheduler": [
    "diffusers",
    "UniPCMultistepScheduler"
  ],
  "text_encoder": [
    "transformers",
    "UMT5EncoderModel"
  ],
  "tokenizer": [
    "transformers",
    "T5TokenizerFast"
  ],
  "transformer": [
    "diffusers",
    "WanTransformer3DModel"
  ],
  "vae": [
    "diffusers",
    "AutoencoderKLWan22"
  ]
}